{
  "header1": "Дар бораи ман",
  "header2": "Маҳоратҳо",
  "header3": "Лоиҳаҳо",
  "header4": "Тамос",
  "text1": "Салом, ман",
  "text2": "Каримов Абдурахмон",
  "text3": "Фронтенд",
  "text4": "Барномасоз",
  "text5": "Зиндагӣ дар",
  "text6": "Тоҷикистон",
  "text8": "Маҳоратҳои",
  "text9": "ман",
  "text10": "Лоиҳаҳои",
  "text21": "Дар бораи",
  "text22": "ман",
  "text23": "Ман як барномасози фронтенди оғозкор ҳастам, ки пеш аз он ки ба таври боэътимод вергулҳоро дар HTML гузорам, ба эҷоди интерфейсҳои вебӣ ошиқ шудам. Маълумоти корбарии қулай, таркиби визуалии хушрӯй ва рамзи пок ва фаҳемро - навъе, ки намехоҳад ба дӯсти барномасоз нишон диҳад, баҳои баланд медиҳам.",
  "text24": "Ман сафари худро ба тозагӣ оғоз кардам, аммо аллакай аз дард, хурсандӣ ва 'чаро ҳама чиз барои ман сафед аст?' ва 'чаро терминал тамоми surx аст?' гузаштам. Ҳоло ман ҳамчун барномасоз рушд мекунам, маҳоратамро дар React, JavaScript, Next.js ва дигар абзорҳои муосире, ки ба эҷоди барномаҳои вебии зуд, муосир ва зинда кӯмак мекунанд, мустаҳкам мекунам.",
  "text25": "Вақте ки ман дар раванди шикори хатоҳо нестам (ё вақте ки хатоҳо маро мешикоранд), ман технологияҳои навро меомӯзам, аз лоиҳаҳои барномасозони дигар илоҳамӣ мегирам ва барои лоиҳаҳои хурди худ идея ҷамъ мекунам. Шумо метавонед маро дар GitHub пайдо кунед - дар он ҷо ман корҳо, таҷрибаҳо ва қадамҳои аввалини худро дар касб мегузорам. Ва агар шумо хоҳед, ки сафари маро пайгирӣ кунед, ман аз обунакунандагони нав хурсанд мешавам!",
  "text26": "Лоиҳаҳои",
  "text27": "ман",
  "text28": "01",
  "text29": "Мағозаи интернетии Comfy",
  "text30": "Ман як барномасози расмӣ нестам, аммо нусхаи комили ин сайти бо функсияҳои корӣ ва аробаи харид сохтам.",
  "text30.1": "Ва, медонед, ҳар чӣ дарозтар ман кор мекардам, ҳамон қадар худро чун як ҷосус фронтенд ҳис мекунам - гӯё ҳеҷ кас инро интизор набуд, аммо ман ҳамаи функсионалиро то охирин тугма такрор кардам.",
  "text30.2": "Ин лоиҳа барои ман як мушкили бузург шуд: ман сохторро таҳлил кардам, мантиқро сохтам, тафсилотро ниҳоӣ кардам ва боварӣ ҳосил кардам, ки метавонам на танҳо саҳифаҳои зебо, балки маҳсулоти воқеии корӣ эҷод кунам. Акнун, вақте ки ман ба натиҷа менигарам, фикр мекунам: 'Хуб, ин ҳама аст, чанд лоиҳаи дигар - ва шумо метавонед ба расмӣ ба Лигаи Барномасозони Супер дархост диҳед'.",
  "text31": "02",
  "text32": "Ман инчунин як мағозаи интернетии пурраи дуввум сохтам, аммо барои маҳсулот. Дар ин лоиҳа, ман категорияҳои қулайро насб кардам, ҷустуҷӯро амалӣ кардам, аробаи корӣ илова кардам ва раванди интихоб ва фармоишро бе қадамҳои зиёд таъмин кардам.",
  "text32.1": "Сайт сабук ва фаҳем шуд: ҳама чиз зуд кор мекунад, ва навигация ҳадди акқар содда аст. Ва ба роҳи ҳол режими торик бо тарҷума дорад. Ҳатто агар шумо хориҷӣ ҳастед, ворид шавед!)",
  "text32.2": "Ин лоиҳа ба ман таҷрибаи хуб дар эҷоди мағозаҳои калон, функсионӣ барои мавзӯъҳои дигар дод.",
  "text33": "Мағозаи интернетии маҳсулот",
  "text34": "03",
  "text34.1": "(шахсии ман)",
  "text35": "Ҳалкунандаи Масъалаҳои Физика - лоиҳаи шахсии ман.",
  "text36": "Алоҳида, ман мехоҳам лоиҳаи шахсии худро - сайти ҳалли масъалаҳои физика қайд кунам. Ин на танҳо як сайти яккаракат нест: ман доимо онро беҳтар мекунам, формулаҳои нав илова мекунам, ҳисобҳоро ислоҳ мекунам ва интерфейсро такмил медиҳам, то ҳама чиз боз ҳам дақиқтар ва қулайтар кор кунад.",
  "text36.1": "Ҳар як навсозӣ монанди такмили хурди қудратҳои аъло аст: ман як вазифа ё формулаи навро дидам, онро фаҳмидам, мантиқро беҳтар кардам, ва сайт зирактар шуд. Ин лоиҳа барои ман монанди организм зинда аст, ки бо дониши ман мерӯяд.",
  "text37": "Роҳ",
  "text38": "Роҳи ман онҷо оғоз шуд, ки ман ба курсҳои барномасозӣ дар Хуҷанд (Тоҷикистон) - дар Learn IT дохил шудам. Ман як сол комил дар он ҷо гузаронд, ва ин на танҳо омӯзиш набуд: бачаҳои Learn IT ҳарфӣ дасти маро мегирифтанд, вақте ки ман бори аввал React кушодам, ва маро ба пеш тела медоданд, вақте ки чизе кор намекард.",
  "text39": "Муаллимон ба тавре шарҳ медоданд, ки ҳатто мураккабтарин мавзӯъҳо дигар наметарсонанд, ва амалӣ корӣ чандон зич буд, ки ҳис мешуд, ки мо аллакай дар лоиҳаҳои воқеӣ кор мекунем. Ва ба тозагӣ ман ин соли таҳсилро анҷом додам - бо дониши бисёр, боварӣ ба қобилияти худ ва орзуи рафтан ба пеш.",
  "text40": "Ба ростӣ, Learn IT он ҷоест, ки оғозкор дигар танҳо оғозкор намебошад. Дар он ҷо шуро ба як барномасозе табдил медиҳанд, ки медонад чӣ мекунад. Ва ҳа, атмосфера низ аъло аст: дастгирӣ, ҳавасмандкунӣ ва бисёр идеяҳо, ки шуморо ба ҳаракат ба боло тела медиҳанд.",
  "text41": "Тамос",
  "text42": "WhatsApp",
  "text43": "Нависед дар WhatsApp",
  "text44": "Telegram",
  "text45": "Нависед дар Telegram",
  "text46": "Instagram",
  "text47": "Обуна шавед дар Instagram",
  "text48": "GitHub",
  "text49": "Дидани лоиҳаҳо",
  "text50": "Ҳатто дар танҳоӣ, муҳим аст бо ҷаҳон дар тамос бошем...",
  "text51": "Ман интерфейсҳои вебии муосир ва қулай месозам, ба ҳар як детал аҳамият медиҳам.",
  "text52": "Ман дар табдил додани идеяҳо ба лоиҳаҳои корӣ лаззат мебарам - аз мағозаҳои интернетӣ то абзорҳо ва хизматрасониҳои шахсии худ.",
  "text53": "Ман доимо меомӯзам, малакаҳои худро такмил медиҳам ва саъй мекунам, ки вебро каме беҳтар аз дируз кунам."
}