{
  "header1": "Обо мне",
  "header2": "Навыки",
  "header3": "Проекты",
  "header4": "Контакты",
  "text1": "Привет, я",
  "text2": "Каримов Абдурахмон",
  "text3": "Front-end",
  "text4": "Разработчик",
  "text5": "Живу в",
  "text6": "Таджикистане",
  "text8": "Мои",
  "text9": "Навыки",
  "text10": "Мой",
  "text21": "Обо",
  "text22": "мне",
  "text23": "Я начинающий фронтенд-разработчик, который влюбился в создание веб-интерфейсов ещё до того, как научился уверенно ставить запятые в HTML. Мне нравится превращать идеи в работающие интерфейсы, где дизайн и функциональность двигаются в одном ритме. Особенно ценю удобный пользовательский опыт, приятную визуальную составляющую и аккуратный, понятный код — тот самый, который не стыдно показать другу-разработчику.",
  "text24": "Свой путь я начал недавно, но уже успел пройти через боль, радость и «почему у меня всё белое?» и «почему терминал весь в красном?». Сейчас я расту как разработчик, укрепляя навыки в React, JavaScript, Next.js и других современных инструментах, которые помогают создавать быстрые, современные и живые веб-приложения.",
  "text25": "Когда я не в процессе охоты на баги (или когда баги охотятся на меня), я изучаю новые технологии, вдохновляюсь проектами других разработчиков и собираю идеи для собственных маленьких pet-проектов. Вы можете найти меня в GitHub — там я выкладываю свои работы, эксперименты и первые шаги в профессии. А если хотите следить за моим путешествием, буду рад новым подписчикам!",
  "text26": "Мои",
  "text27": "Проекты",
  "text28": "01",
  "text29": "Интернет магазин Comfy",
  "text30": "Я не являюсь официальным разработчиком, но сделал полную копию этого сайта с рабочими функциями и корзиной.",
  "text30.1": "И, знаешь, чем дольше работал над ним, тем больше чувствовал себя тайным агентом фронтенда — будто никто не ожидал, а я взял и повторил весь функционал до последней кнопки.",
  "text30.2": "Этот проект стал для меня отличным испытанием: я разобрал структуру, выстроил логику, допилил детали и убедился, что могу создавать не просто красивые страницы, а реальные рабочие продукты. Теперь, когда смотрю на результат, думаю: «Ну всё, ещё пару таких проектов — и можно официально подавать заявку в Лигу Супер-Разработчиков».",
  "text31": "02",
  "text32": "Также я сделал второй полноценный интернет-магазин, но уже для продуктов.В этом проекте я настроил удобные категории, реализовал поиск, добавил рабочую корзину и сделал так, чтобы выбор и оформление заказа проходили без лишних шагов.",
  "text32.1": "Сайт получился лёгким и понятным: всё работает быстро, а навигация максимально проста. И ещё кстати имеет тёмный режим с переводом. Залетай если ты даже иностранец!)",
  "text32.2": "Этот проект дал мне хороший опыт в создании больших, функциональных магазинов под другую тематику.",
  "text33": "Интернет магазин продуктов",
  "text34": "03",
  "text34.1": "(мой личный)",
  "text35": "Решатель задач по физике - мой личный проект.",
  "text36": "Отдельно хочу отметить мой личный проект — сайт-решатель задач по физике. Это не просто разовый сайт: я постоянно его улучшаю, добавляю новые формулы, поправляю расчёты и дорабатываю интерфейс, чтобы всё работало ещё точнее и удобнее.",
  "text36.1": "Каждое обновление — это как маленький апгрейд суперспособностей: увидел новую задачу или формулу, разобрался, улучшил логику, и сайт стал умнее. Этот проект для меня — как живой организм, который растёт вместе с моими знаниями.",
  "text37": "Путь",
  "text38": "Мой путь начался с того, что я поступил на курсы программирования в Худжанде (Таджикистан) — в Learn IT. Там я провёл целый год, и это было не просто обучение: ребята из Learn IT буквально держали меня за руку, когда я впервые открывал React, и подталкивали вперёд, когда что-то не получалось.",
  "text39": "Учителя объясняли так, что даже самые сложные темы переставали пугать, а практика была такой насыщенной, что ощущалось, будто мы уже работаем над реальными проектами. И недавно я завершил этот год обучения — с кучей знаний, уверенностью в своих силах и желанием идти дальше.",
  "text40": "Если честно, Learn IT — это то место, где новичок перестаёт быть просто новичком. Там из тебя делают разработчика, который знает, что делает. И да, атмосфера тоже топовая: поддержка, мотивация и куча идей, которые подталкивают двигаться выше.",
  "text41": "Контакты",
  "text42": "WhatsApp",
  "text43": "Написать в WhatsApp",
  "text44": "Telegram",
  "text45": "Написать в Telegram",
  "text46": "Instagram",
  "text47": "Подписаться в Instagram",
  "text48": "GitHub",
  "text49": "Посмотреть проекты",
  "text50": "Даже в одиночестве важно оставаться на связи с миром...",
  "text51": "Я создаю удобные и современные веб-интерфейсы, уделяя внимание каждой детали.",
  "text52": "Люблю превращать идеи в работающие проекты — от интернет-магазинов до собственных инструментов и сервисов.",
  "text53": "Постоянно учусь, улучшаю свои навыки и стремлюсь делать веб чуть лучше, чем он был вчера."
}