{
  "header1": "About Me",
  "header2": "Skills",
  "header3": "Projects",
  "header4": "Contacts",
  "text1": "Hello, I'm",
  "text2": "Karimov Abdurahmon",
  "text3": "Front-end",
  "text4": "Developer",
  "text5": "Living in",
  "text6": "Tajikistan",
  "text8": "My",
  "text9": "Skills",
  "text10": "My",
  "text21": "About",
  "text22": "Me",
  "text23": "I am a beginner frontend developer who fell in love with creating web interfaces even before I learned to confidently place commas in HTML. I enjoy turning ideas into working interfaces where design and functionality move in the same rhythm. I especially appreciate convenient user experience, pleasant visual components and neat, understandable code - the kind that is not ashamed to show to a developer friend.",
  "text24": "I started my journey recently, but I have already been through pain, joy and 'why is everything white for me?' and 'why is the terminal all red?'. Now I am growing as a developer, strengthening my skills in React, JavaScript, Next.js and other modern tools that help create fast, modern and lively web applications.",
  "text25": "When I'm not in the process of hunting for bugs (or when bugs are hunting for me), I study new technologies, get inspired by other developers' projects and collect ideas for my own small pet projects. You can find me on GitHub - there I post my works, experiments and first steps in the profession. And if you want to follow my journey, I will be glad to have new subscribers!",
  "text26": "My",
  "text27": "Projects",
  "text28": "01",
  "text29": "Comfy Online Store",
  "text30": "I am not an official developer, but I made a complete copy of this site with working functions and a shopping cart.",
  "text30.1": "And, you know, the longer I worked on it, the more I felt like a secret frontend agent - as if no one expected it, but I took and repeated all the functionality to the last button.",
  "text30.2": "This project became a great challenge for me: I analyzed the structure, built the logic, finalized the details and made sure that I can create not just beautiful pages, but real working products. Now, when I look at the result, I think: 'Well, that's it, a couple more such projects - and you can officially apply to the League of Super Developers'.",
  "text31": "02",
  "text32": "I also made a second full-fledged online store, but for products. In this project, I set up convenient categories, implemented search, added a working cart and made sure that the selection and ordering process went without unnecessary steps.",
  "text32.1": "The site turned out to be light and understandable: everything works quickly, and navigation is as simple as possible. And by the way it has dark mode with translation. Come in even if you are a foreigner!)",
  "text32.2": "This project gave me good experience in creating large, functional stores for other topics.",
  "text33": "Grocery Online Store",
  "text34": "03",
  "text34.1": "(my personal)",
  "text35": "Physics Problem Solver - my personal project.",
  "text36": "Separately, I want to note my personal project - a physics problem solving site. This is not just a one-time site: I constantly improve it, add new formulas, adjust calculations and refine the interface so that everything works even more accurately and conveniently.",
  "text36.1": "Each update is like a small upgrade of superpowers: I saw a new task or formula, figured it out, improved the logic, and the site became smarter. This project for me is like a living organism that grows with my knowledge.",
  "text37": "Path",
  "text38": "My path began when I entered programming courses in Khujand (Tajikistan) - at Learn IT. I spent a whole year there, and it was not just training: the guys from Learn IT literally held my hand when I first opened React, and pushed me forward when something didn't work out.",
  "text39": "The teachers explained in such a way that even the most difficult topics ceased to be scary, and the practice was so intense that it felt like we were already working on real projects. And recently I completed this year of study - with a lot of knowledge, confidence in my abilities and a desire to go further.",
  "text40": "To be honest, Learn IT is the place where a beginner ceases to be just a beginner. There you are made into a developer who knows what he is doing. And yes, the atmosphere is also top-notch: support, motivation and a lot of ideas that push you to move higher.",
  "text41": "Contacts",
  "text42": "WhatsApp",
  "text43": "Write on WhatsApp",
  "text44": "Telegram",
  "text45": "Write on Telegram",
  "text46": "Instagram",
  "text47": "Follow on Instagram",
  "text48": "GitHub",
  "text49": "View projects",
  "text50": "Even when alone, it's important to stay connected with the world...",
  "text51": "I create convenient and modern web interfaces, paying attention to every detail.",
  "text52": "I love turning ideas into working projects - from online stores to my own tools and services.",
  "text53": "I constantly learn, improve my skills and strive to make the web a little better than it was yesterday."
}